# -*- coding: utf-8 -*-
import unittest

try:
    from src.pymorse import Morse
except:
    from pymorse import Morse


class TestCase(unittest.TestCase):

    def test_encode(self):
        m1 = Morse.encode('hello, world!')
        m2 = Morse.encode('12345,yes!OK')
        m3 = Morse.encode('你好，世界！')
        m4 = Morse.encode('知己知彼，百战不殆，Go Die!')

        self.assertEqual(m1, '...././.-../.-../---/--..--'
                             '/.--/---/.-./.-../-../-.-.--')
        self.assertEqual(m2, '.----/..---/...--/....-/...../--..--/-'
                             '.--/./.../-.-.--/---/-.-')
        self.assertEqual(m3, '-..----.--...../-.--..-.-----.-'
                             '/--------....--../-..---....-.--./---.-'
                             '.-.-..--../--------.......-')
        self.assertEqual(m4, '---.------..-.-/-.---.-----...-/---.--'
                             '----..-.-/-.-----.-----../--------....--../---.--'
                             '..------./--...-....--.../-..---.....--.-/--.-.-'
                             '--....--./--------....--../--./---/-../.'
                             '././-.-.--')

    def test_decode(self):
        c1 = Morse.decode('...././.-../.-../---/--..--/.--/---/.-./.'
                               '-../-../-.-.--')
        c2 = Morse.decode('.----/..---/...--/....-/...../--..--/-.--/./'
                               '.../-.-.--/---/-.-')
        c3 = Morse.decode('-..----.--...../-.--..-.-----.-/--------....'
                               '--../-..---....-.--./---.-.-.-..--../-------'
                               '-.......-')
        c4 = Morse.decode('---.------..-.-/-.---.-----...-/---.------..-.'
                               '-/-.-----.-----../--------....--../---.--..---'
                               '---./--...-....--.../-..---.....--.-/--.-.---.'
                               '...--./--------....--../--./---/-../.././-.-.'
                               '--')

        self.assertEqual(c1, 'HELLO,WORLD!')
        self.assertEqual(c2, '12345,YES!OK')
        self.assertEqual(c3, '你好，世界！')
        self.assertEqual(c4, '知己知彼，百战不殆，GODIE!')


if __name__ == '__main__':
    unittest.main()